Repository: Zaineb271/SNI_PARTICULIER
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: CARTHAGO SCORING 1.0.0
ar: كارثاغو سكورينغ 1.0.0

source: Welcome admin
ar: مرحبًا بالمسؤول
fr: Bienvenue admin

source: Data Overview
ar: نظرة عامة على البيانات
fr: Aperçu des données

source: Visualization
ar: التصور
fr: Visualisation

source: Feature Selection
ar: اختيار المتغيرات
fr: Sélection des variables

source: Modeling
ar: النمذجة
fr: Modélisation

source: Periodic Risk Evaluation
ar: تقييم المخاطر الدوري
fr: Évaluation périodique du risque

source: 360° Risk Portfolio View
ar: رؤية 360 درجة لمحفظة المخاطر
fr: Vision 360° du portefeuille risque

source: Client File
ar: ملف العميل
fr: Fiche client

source: Quick Search ...
ar: بحث سريع ...
fr: Recherche rapide ...

source: Logo
ar: الشعار

source: User
ar: المستخدم
fr: Utilisateur

source: Folder
ar: مجلد
fr: Dossier

source: Full Data Display
ar: عرض البيانات الكامل
fr: Affichage complet des données

source: Data Preview and Preprocessing
ar: معاينة البيانات والمعالجة المسبقة
fr: Aperçu et pré-traitement des données

source: Current Target Variable
ar: المتغير المستهدف الحالي
fr: La variable cible actuelle

source: Descriptive Statistics
ar: الإحصاءات الوصفية
fr: Statistiques descriptives

source: Target Variable Selection
ar: اختيار المتغير المستهدف
fr: Choix de la variable cible

source: Save
ar: حفظ
fr: Enregistrer

source: Missing Values
ar: القيم المفقودة
fr: Valeurs manquantes

source: Column
ar: العمود
fr: Colonne

source: Percentage
ar: النسبة المئوية
fr: Pourcentage

source: Action
ar: الإجراء

source: Delete
ar: حذف
fr: Supprimer

source: Impute with Mean
ar: التعبئة بالمتوسط

source: Impute with Mode
ar: التعبئة بالوضع

source: Impute with Median
ar: التعبئة بالوسيط

source: Visualization Choices
ar: خيارات التصور
fr: Choix des visualisations

source: Pie Chart Visualization
ar: تصور الرسم البياني الدائري
fr: Visualisation de diagramme circulaire

source: Categorical Distribution Visualization
ar: تصور توزيع الفئات
fr: Visualisation de la distribution catégorielle

source: Numerical Distribution Visualization
ar: تصور توزيع الأرقام
fr: Visualisation de la distribution numérique

source: Visualize
ar: تصور
fr: Visualiser

source: Current Target Column
ar: العمود المستهدف الحالي
fr: Colonne cible actuelle

source: Run Calculations
ar: تشغيل الحسابات
fr: Exécuter les calculs

source: Dependency Analysis between Categorical Variables and Target Variable
ar: تحليل الاعتماد بين المتغيرات الفئوية والمتغير المستهدف
fr: Analyse de dépendance entre les variables catégorielles et la variable cible

source: The ANOVA test is used to study the dependency relationship of a quantitative variable to a qualitative variable.
ar: يُستخدم اختبار ANOVA لدراسة علاقة الاعتماد بين متغير كمي ومتغير نوعي.
fr: Le test ANOVA est utilisé pour étudier le rapport de dépendance d'une variable quantitative à une variable qualitative.

source: P-value > 0.05: acceptance of H0, so the default does not depend on the variable. This variable is not important in prediction.
ar: القيمة الاحتمالية > 0.05: قبول H0، لذا لا يعتمد الافتراضي على المتغير. هذا المتغير غير مهم في التنبؤ.
fr: P-value > 0,05 : acceptation de H0 donc le défaut ne dépend pas de la variable. Cette variable n’est pas importante dans la prédiction.

source: P-value < 0.05: rejection of H0, so the default criterion depends on the variable. This variable is important in prediction.
ar: القيمة الاحتمالية < 0.05: رفض H0، لذا يعتمد معيار الافتراضي على المتغير. هذا المتغير مهم في التنبؤ.
fr: P-value < 0,05 : rejet de H0 donc le critère défaut dépend de la variable. Cette variable est importante dans la prédiction.

source: Variables
ar: المتغيرات

source: P_value
ar: القيمة الاحتمالية

source: Independence
ar: الاستقلال
fr: Indépendance

source: Dependency Analysis between Numerical Variables and Target Variable
ar: تحليل الاعتماد بين المتغيرات العددية والمتغير المستهدف
fr: Analyse de dépendance entre les variables numériques et la variable cible

source: Information Value is a widely used technique in variable selection.
ar: قيمة المعلومات هي تقنية مستخدمة على نطاق واسع في اختيار المتغيرات.
fr: L’information Value est une technique très utilisée dans la sélection des variables.

source: When Information Value (IV) increases, the predictive power of the variable increases.
ar: عندما تزداد قيمة المعلومات (IV)، تزداد القوة التنبؤية للمتغير.
fr: Quand l’information Value (IV) augmente, la puissance prédictive du variable augmente.

source: We eliminate variables with an IV < 0.1. For strong predictive power, IV > 0.3 is required.
ar: نستبعد المتغيرات التي لها IV < 0.1. للحصول على قوة تنبؤية قوية، يجب أن يكون IV > 0.3.
fr: On élimine les variables qui ont une IV < 0,1. Pour un pouvoir prédictif puissant, il faut que l’IV > 0,3.

source: IV
ar: قيمة المعلومات

source: Category
ar: الفئة
fr: Catégorie

source: Correlation Matrix
ar: مصفوفة الارتباط
fr: Matrice de corrélation

source: Correlation is a coefficient that measures the linear dependency between variables.
ar: الارتباط هو معامل يقيس الاعتماد الخطي بين المتغيرات.
fr: La corrélation est un coefficient qui mesure la dépendance linéaire entre les variables.

source: Correlated Variables
ar: المتغيرات المرتبطة
fr: Variables corrélées

source: Correlation
ar: الارتباط
fr: Corrélation

source: Column to Delete
ar: العمود المراد حذفه
fr: Colonne à supprimer

source: Transition Matrix in Heatmap
ar: مصفوفة الانتقال في خريطة حرارية
fr: Matrice de transition en heatmap

source: Transition Matrix of Default Probability between Year N and N+1
ar: مصفوفة الانتقال لاحتمالية الافتراضي بين السنة N و N+1
fr: Matrice de transition de probabilité de défaut entre l'année N et N+1

source: Generate Transition Matrix
ar: إنشاء مصفوفة الانتقال
fr: Générer la matrice de transition

source: Transition Matrix
ar: مصفوفة الانتقال
fr: Matrice de transition

source: The transition matrix is generated between Year 'N' and 'N+1'.
ar: تم إنشاء مصفوفة الانتقال بين السنة 'N' و 'N+1'.
fr: La matrice de transition est générée entre l'année 'N' et 'N+1'.

source: Default Probability
ar: احتمالية الافتراضي
fr: Probabilité de défaut

source: Model Performance
ar: أداء النموذج
fr: Performance du modèle

source: Model Summary
ar: ملخص النموذج
fr: Résumé du modèle

source: Model Accuracy: {{ accuracy }}
ar: دقة النموذج: {{ accuracy }}
fr: Exactitude du modèle : {{ accuracy }}

source: Classification Report
ar: تقرير التصنيف
fr: Rapport de classification

source: Confusion Matrix
ar: مصفوفة الارتباك
fr: Matrice de confusion

source: ROC Curve
ar: منحنى ROC
fr: Courbe ROC

source: Estimated Default Probability for 2024
ar: احتمالية الافتراضي المقدرة لعام 2024
fr: Probabilité de défaut estimée pour 2024

source: ID
ar: المعرف
fr: Identifiant

source: PD 2024
ar: احتمالية الافتراضي 2024

source: Risk Class
ar: فئة المخاطر
fr: Classe de risque

source: Risk Comment
ar: تعليق المخاطر
fr: Commentaire risque

source: Estimated Lifetime PD
ar: احتمالية الافتراضي مدى الحياة المقدرة
fr: PD à vie (Lifetime) estimée

source: PD Lifetime
ar: احتمالية الافتراضي مدى الحياة

source: PD Histogram for 2024
ar: هستوغرام احتمالية الافتراضي لعام 2024
fr: Histogramme PD pour 2024

source: Model Backtesting
ar: اختبار النموذج الرجعي
fr: Backtesting du modèle

source: Mean Squared Error (MSE):
ar: خطأ التربيع المتوسط (MSE):

source: R-squared (R²):
ar: معامل التحديد (R²):

source: Backtesting between Actual PD and Predicted PD
ar: الاختبار الرجعي بين احتمالية الافتراضي الفعلية والمتنبأ بها
fr: Backtesting entre PD réelle et PD prédite

source: Correlations for 2024
ar: الارتباطات لعام 2024
fr: Corrélations pour 2024

source: Inflation
ar: التضخم

source: Unemployment
ar: البطالة
fr: Chômage

source: Growth
ar: النمو
fr: Croissance

source: PD_2024 adjusted based on scenarios
ar: احتمالية الافتراضي 2024 المعدلة بناءً على السيناريوهات
fr: PD_2024 ajusté selon les scénarios

source: PD
ar: احتمالية الافتراضي

source: Scenario
ar: السيناريو
fr: Scénario

source: PD_2024 Initial
ar: احتمالية الافتراضي الأولية 2024

source: PD_2025 Adjusted
ar: احتمالية الافتراضي المعدلة 2025
fr: PD_2025 Ajusté

source: Loss Given Default
ar: الخسارة في حالة الافتراضي
fr: Perte en cas de défaut

source: Loss Given Default Rate
ar: معدل الخسارة في حالة الافتراضي
fr: Taux de perte en cas de défaut

source: LGD Results
ar: نتائج الخسارة في حالة الافتراضي
fr: Résultats du LGD

source: LGD Model Results
ar: نتائج نموذج الخسارة في حالة الافتراضي
fr: Résultats du modèle LGD

source: Classification - Report
ar: التصنيف - التقرير
fr: Classification - Rapport

source: Model Errors
ar: أخطاء النموذج
fr: Erreurs du modèle

source: MAE:
ar: متوسط الخطأ المطلق:

source: MSE:
ar: خطأ التربيع المتوسط:

source: RMSE:
ar: جذر متوسط الخطأ التربيعي:

source: R² Score:
ar: نقاط R²:

source: LGD Predictions
ar: توقعات الخسارة في حالة الافتراضي
fr: Prédictions du LGD

source: LGD Distribution
ar: توزيع الخسارة في حالة الافتراضي
fr: Distribution du LGD

source: LGD
ar: الخسارة في حالة الافتراضي

source: Exposure at Default
ar: التعرض عند الافتراضي
fr: Exposition au moment du défaut

source: CCF and EAD Values
ar: قيم عامل التحويل الائتماني والتعرض عند الافتراضي
fr: Valeurs du CCF et EAD

source: EAD
ar: التعرض عند الافتراضي

source: Portfolio Summary
ar: ملخص المحفظة
fr: Résumé du portefeuille

source: Number of Files
ar: عدد الملفات
fr: Nombre de dossiers

source: Total EAD
ar: إجمالي التعرض عند الافتراضي
fr: EAD total

source: Total ECL
ar: إجمالي الخسارة الائتمانية المتوقعة
fr: ECL total

source: Total UL
ar: إجمالي الخسارة غير المتوقعة
fr: UL total

source: Total RWA
ar: إجمالي الأصول المرجحة بالمخاطر
fr: RWA total

source: Capital to Reserve
ar: رأس المال المطلوب حجبه
fr: Fonds propres à réserver

source: Average PD
ar: متوسط احتمالية الافتراضي
fr: PD moyenne

source: Average LGD
ar: متوسط الخسارة في حالة الافتراضي
fr: LGD moyenne

source: Global Provision Rate
ar: معدل التزويد العام
fr: Taux de provision global

source: Distribution by Risk Level
ar: التوزيع حسب مستوى المخاطر
fr: Répartition par niveau de risque

source: ECL
ar: الخسارة الائتمانية المتوقعة

source: UL
ar: الخسارة غير المتوقعة

source: Risk Indicators
ar: مؤشرات المخاطر
fr: Indicateurs risque

source: Provisioning Rate
ar: معدل التزويد
fr: Taux de provisionnement

source: RWA
ar: الأصول المرجحة بالمخاطر

source: Search
ar: بحث
fr: Rechercher

source: Please provide a client ID.
ar: يرجى تقديم معرف العميل.
fr: Veuillez fournir un ID de client.

source: Identification
ar: التعريف

source: Rating according to IFRS 9
ar: التصنيف وفقًا للمعيار IFRS 9
fr: Notation selon IFRS 9

source: Data Overview and Preprocessing
ar: نظرة عامة على البيانات والمعالجة المسبقة
fr: Aperçu des données et prétraitement

source: Database Dimensions
ar: أبعاد قاعدة البيانات

source: Very Good
ar: جيد جدًا
fr: Très bonne

source: Good
ar: جيد
fr: Bonne

source: Average
ar: متوسط
fr: Moyenne

source: To observe
ar: للمراقبة
fr: A surveiller

source: Excellent
ar: ممتاز

source: Impute with mode
fr: Imputer par mode

source: Impute with mean
fr: Imputer par moyenne

source: Impute with median
fr: Imputer par médiane

source: Enter Client ID
fr: Entrer ID du client

source: Please provide a valid Client ID.
fr: Veuillez fournir un ID de client valide.

source: General Information
fr: Informations Générales

source: Annual Revenue
fr: Revenus annuels

source: Central Bank Class
fr: Classe Banque Centrale

source: Financing Type
fr: Type de financement

source: Engagement Details
fr: Détails engagement

source: Loan Amount
fr: Montant crédit

source: Repayment Term
fr: Remboursement

source: Effective Interest Rate
fr: Taux d'intérêt effectif

source: Monthly Payment
fr: Mensualité

source: Repayment Capacity
fr: Capacité de remboursement

source: Remaining Capital Due
fr: Capital restant dû

source: Principal Paid
fr: Principal Payé

source: Interest Paid
fr: Intérêts Payés

source: Total Repayment
fr: Total remboursement

source: Regulatory Indicators
fr: Indicateurs réglementaires

source: Capital Reserves Required
fr: Fonds propres à réserver
